УТ/src/InformationRegisters/CRM_ЖурналДокументов/CRM_ЖурналДокументов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>CRM_ЖурналДокументов</name>
  <resources>
    <name>ТипОбъекта</name>
    <type>
      <types>ChartOfCharacteristicTypesRef.CRM_ОбъектыЖурналаДокументов</types>
    </type>
  </resources>
  <resources>
    <name>Номер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Дата</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </resources>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Валюта</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </resources>
  <resources>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </resources>
  <resources>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </resources>
  <resources>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.СтруктураПредприятия</types>
    </type>
  </resources>
  <resources>
    <name>Описание</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Важность</name>
    <type>
      <types>EnumRef.ВариантыВажностиВзаимодействия</types>
    </type>
  </resources>
  <resources>
    <name>Проект</name>
    <type>
      <types>CatalogRef.Проекты</types>
    </type>
  </resources>
  <resources>
    <name>ВходящееИсходящее</name>
    <type>
      <types>EnumRef.CRM_ВходящееИсходящееСобытие</types>
    </type>
  </resources>
  <resources>
    <name>ВидСобытия</name>
    <type>
      <types>EnumRef.CRM_ВидыСобытий</types>
    </type>
  </resources>
  <resources>
    <name>ПометкаУдаления</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>Проведен</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>КонтактноеЛицо</name>
    <type>
      <types>CatalogRef.КонтактныеЛицаПартнеров</types>
    </type>
  </resources>
  <resources>
    <name>СостояниеСобытия</name>
    <type>
      <types>CatalogRef.CRM_СостоянияСобытий</types>
    </type>
  </resources>
  <resources>
    <name>СостояниеИнтереса</name>
    <comment>Состояние интереса</comment>
    <type>
      <types>CatalogRef.CRM_СостоянияИнтересов</types>
    </type>
  </resources>
  <resources>
    <name>ЕстьПрисоединенныеФайлы</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ОсновнойИнтерес</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ИнтересЯвляетсяОснованием</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>СписокУчастников</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <dimensions>
    <name>ГлавнаяЗапись</name>
    <type>
      <types>Boolean</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Клиент</name>
    <type>
      <types>CatalogRef.Партнеры</types>
      <types>CatalogRef.CRM_ПотенциальныеКлиенты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Объект</name>
    <type>
      <types>Characteristic.CRM_ОбъектыЖурналаДокументов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>CRM_Интерес</name>
    <comment>Интерес</comment>
    <type>
      <types>DocumentRef.CRM_Интерес</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

УТ/src/CommonModules/CRM_УдалениеПомеченныхОбъектов/Module.bsl
///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2023, ООО 1С-Рарус
// Все права защищены.
///////////////////////////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

// Процедура-обработчик события перед удалением объекта.
//
// Параметры:
//  Источник - Произвольный	 - Объект информационной базы.
//  Отказ	 - Булево	 - Флаг отказа.
//
Процедура ПередУдалениемОбъекта(Источник, Отказ) Экспорт

	Если Источник.ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если ТранзакцияАктивна() Тогда
		УдалитьПодчиненныеОбъекты(Источник);
	КонецЕсли;
	
КонецПроцедуры

// Процедура выполняет удаление из набора записи с очищенной ссылкой.
//
// Параметры:
//  Набор			 - РегистрСведенийНаборЗаписей	 - Набор записей.
//  УдаляемыйСсылка	 - Ссылка	 - Ссылка, которую нужно удалить.
//
Процедура УдалитьИзНабораЗаписиСОчищеннойСсылкой(Набор, УдаляемыйСсылка) Экспорт
	
	Если Набор.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	ТЗНабор = Набор.Выгрузить();
	Если ТЗНабор.Найти(УдаляемыйСсылка) = Неопределено Тогда
		Набор.Очистить();
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура УдалитьПодчиненныеОбъекты(Источник)
	
	ПодчиненныеОбъекты = ПодчиненныеОбъекты(Источник);
	Для каждого ПодчиненныйОбъект Из ПодчиненныеОбъекты Цикл
		Если Метаданные.РегистрыСведений.Содержит(ПодчиненныйОбъект.Метаданные) Тогда
			ОбработатьРегистрСведений(Источник.Ссылка, ПодчиненныйОбъект);
		ИначеЕсли ОбщегоНазначения.ЭтоОбъектСсылочногоТипа(ПодчиненныйОбъект.Метаданные) Тогда
			ОбработатьОбъектСсылочногоТипа(Источник.Ссылка, ПодчиненныйОбъект);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

Функция ПодчиненныеОбъекты(Источник)
	
	Подчиненные = Новый Массив;
	ТипИсточника = ТипЗнч(Источник);
	ТипСсылкиИсточника = ТипЗнч(Источник.Ссылка);
	Свойства = "Метаданные, Реквизит, Действие";
	Если ТипИсточника = Тип("ДокументОбъект.CRM_Интерес") Тогда
		Подчиненные.Добавить(Новый Структура(Свойства, Метаданные.РегистрыСведений.CRM_ЖурналДокументов,
			 "CRM_Интерес",
			 "Очистить"));
		Подчиненные.Добавить(Новый Структура(Свойства, Метаданные.РегистрыСведений.CRM_СостоянияЛидов,
			 "СконвертированВОбъект",
			 "Очистить"));
		Подчиненные.Добавить(Новый Структура(Свойства,
			 Метаданные.РегистрыСведений.CRM_РабочееВремяПользователей, "Интерес",
			 "Очистить"));
	ИначеЕсли ТипИсточника = Тип("СправочникОбъект.Партнеры") Тогда
		Подчиненные.Добавить(Новый Структура(Свойства,
			 Метаданные.РегистрыСведений.CRM_ЗадачиПоИсправлениюКлиентскойБазы, "ПартнерРодитель",
			 "Удалить"));
		Подчиненные.Добавить(Новый Структура(Свойства,
			 Метаданные.РегистрыСведений.CRM_ИсторияЗначенийКлассификаторовОбъектов, "ЗначениеРеквизита",
			 "Удалить"));
		Подчиненные.Добавить(Новый Структура(Свойства,
			 Метаданные.РегистрыСведений.CRM_ОбъектыЗначенийКлассификаторов, "ЗначениеРеквизита",
			 "Удалить"));

		Подчиненные.Добавить(Новый Структура(Свойства,
			 Метаданные.РегистрыСведений.CRM_СостоянияВоронкиПродаж, "Партнер",
			 "Очистить"));
		Подчиненные.Добавить(Новый Структура(Свойства, Метаданные.РегистрыСведений.CRM_ОбъектыАРМ, "Клиент", "Очистить"));
		Подчиненные.Добавить(Новый Структура(Свойства,
			 Метаданные.РегистрыСведений.сфпЗаписиТелефонныхПереговоров, "Контакт",
			 "Очистить"));
		Подчиненные.Добавить(Новый Структура(Свойства, Метаданные.РегистрыСведений.сфпТекущиеЗвонки,
			 "АбонентКонтакт",
			 "Очистить"));
	ИначеЕсли ТипИсточника = Тип("СправочникОбъект.КонтактныеЛицаПартнеров") Тогда
		Подчиненные.Добавить(Новый Структура(Свойства,
			 Метаданные.РегистрыСведений.CRM_ИсторияЗначенийКлассификаторовОбъектов, "ЗначениеРеквизита",
			 "Удалить"));
		Подчиненные.Добавить(Новый Структура(Свойства,
			 Метаданные.РегистрыСведений.CRM_ОбъектыЗначенийКлассификаторов, "ЗначениеРеквизита",
			 "Удалить"));

		Подчиненные.Добавить(Новый Структура(Свойства, Метаданные.РегистрыСведений.CRM_ОбъектыАРМ, "Контакт", "Очистить"));
		Подчиненные.Добавить(Новый Структура(Свойства,
			 Метаданные.РегистрыСведений.сфпЗаписиТелефонныхПереговоров, "Контакт",
			 "Очистить"));
		Подчиненные.Добавить(Новый Структура(Свойства, Метаданные.РегистрыСведений.сфпТекущиеЗвонки,
			 "АбонентКонтакт",
			 "Очистить"));
	ИначеЕсли ТипИсточника = Тип("СправочникОбъект.CRM_ПотенциальныеКлиенты") Тогда
		Подчиненные.Добавить(Новый Структура(Свойства,
			 Метаданные.РегистрыСведений.CRM_СостоянияВоронкиПродаж, "Партнер",
			 "Очистить"));
		Подчиненные.Добавить(Новый Структура(Свойства, Метаданные.РегистрыСведений.CRM_ОбъектыАРМ, "Клиент", "Очистить"));
		Подчиненные.Добавить(Новый Структура(Свойства,
			 Метаданные.РегистрыСведений.сфпЗаписиТелефонныхПереговоров, "Контакт",
			 "Очистить"));
		Подчиненные.Добавить(Новый Структура(Свойства, Метаданные.РегистрыСведений.сфпТекущиеЗвонки,
			 "АбонентКонтакт",
			 "Очистить"));
	ИначеЕсли ТипИсточника = Тип("ДокументОбъект.CRM_СообщениеМессенджера") Тогда
		Подчиненные.Добавить(Новый Структура(Свойства,
			 Метаданные.РегистрыСведений.CRM_СобытияМессенджеров, "Значение",
			 "Удалить"));
		Подчиненные.Добавить(Новый Структура(Свойства,
			 Метаданные.РегистрыСведений.CRM_СообщенияДиалоговПоследние, "Сообщение",
			 "Удалить"));
	КонецЕсли;
	
	Если Метаданные.РегистрыСведений.ПредметыПапкиВзаимодействий.Ресурсы.Предмет.Тип.СодержитТип(ТипСсылкиИсточника) Тогда
		Подчиненные.Добавить(Новый Структура(Свойства,
			 Метаданные.РегистрыСведений.ПредметыПапкиВзаимодействий, "Предмет",
			 "Очистить"));
	КонецЕсли;
	
	Возврат Подчиненные;
	
КонецФункции

Процедура ОбработатьРегистрСведений(Ссылка, ПодчиненныйОбъект)
	
	МассивИзмерений = Новый Массив;
	Для каждого Измерение Из ПодчиненныйОбъект.Метаданные.Измерения Цикл
		МассивИзмерений.Добавить(Измерение.Имя);
	КонецЦикла;
	Если ПодчиненныйОбъект.Метаданные.ПериодичностьРегистраСведений <> Метаданные.СвойстваОбъектов.ПериодичностьРегистраСведений.Непериодический Тогда
		МассивИзмерений.Добавить("Период");
	КонецЕсли;
	ИзмеренияСтр = СтрСоединить(МассивИзмерений, ",");
	
	Запрос = Новый Запрос();
	Запрос.Текст = "ВЫБРАТЬ
	               |	*
	               |ИЗ
	               |	РегистрСведений." + ПодчиненныйОбъект.Метаданные.Имя + " КАК ДанныеРегистра
	               |ГДЕ
	               |	ДанныеРегистра." + ПодчиненныйОбъект.Реквизит + " = &Значение";
	
	Запрос.УстановитьПараметр("Значение", Ссылка);
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Менеджер = РегистрыСведений[ПодчиненныйОбъект.Метаданные.Имя].СоздатьМенеджерЗаписи();
		ЗаполнитьЗначенияСвойств(Менеджер, Выборка, ИзмеренияСтр);
		Менеджер.Прочитать();
		Если Менеджер.Выбран() Тогда
			Если ПодчиненныйОбъект.Метаданные = Метаданные.РегистрыСведений.CRM_ЖурналДокументов Тогда
				Если Менеджер["ГлавнаяЗапись"] Тогда
					Запрос.Текст = "ВЫБРАТЬ
					               |	КОЛИЧЕСТВО(CRM_ЖурналДокументов.ГлавнаяЗапись) КАК ГлавнаяЗапись
					               |ИЗ
					               |	РегистрСведений.CRM_ЖурналДокументов КАК CRM_ЖурналДокументов
					               |ГДЕ
					               |	CRM_ЖурналДокументов.Объект = &Объект";
					Запрос.УстановитьПараметр("Объект", Выборка.Объект);
					ВыборкаГЗ = CRM_ОбщегоНазначенияСервер.ВыполнитьЗапрос(Запрос).Выбрать();
					Если ВыборкаГЗ.Следующий() Тогда
						Если ВыборкаГЗ.ГлавнаяЗапись > 1 Тогда
							ПодчиненныйОбъект.Действие = "Удалить";
						КонецЕсли;
					КонецЕсли;
				Иначе
					ПодчиненныйОбъект.Действие = "Удалить";
				КонецЕсли;
			КонецЕсли;
			Если ПодчиненныйОбъект.Действие = "Удалить" Тогда
				Менеджер.Удалить();
			ИначеЕсли ПодчиненныйОбъект.Действие = "Очистить" Тогда
				Менеджер[ПодчиненныйОбъект.Реквизит] = Неопределено;
				Менеджер.Записать();
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

Процедура ОбработатьОбъектСсылочногоТипа(Ссылка, ПодчиненныйОбъект)
	
	Запрос = Новый Запрос();
	Запрос.Текст = "ВЫБРАТЬ
	               |	ДанныеОбъекта.Ссылка
	               |ИЗ
	               |	" + ПодчиненныйОбъект.Метаданные.ПолноеИмя() + " КАК ДанныеОбъекта
	               |ГДЕ
	               |	ДанныеОбъекта." + ПодчиненныйОбъект.Реквизит + " = &Значение";
	
	Запрос.УстановитьПараметр("Значение", Ссылка);
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Объект = Выборка.Ссылка.ПолучитьОбъект();
		Если ПодчиненныйОбъект.Действие = "Удалить" Тогда
			Объект.Удалить();
		ИначеЕсли ПодчиненныйОбъект.Действие = "Очистить" Тогда
			Объект[ПодчиненныйОбъект.Реквизит] = Неопределено;
			Объект.Записать();
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти
